/// 円周率の小数第 100 位までの値は
/// 3.1415926535897932384626433832795028841971693993751058209749445923078164062862089986280348253421170679
/// です。
/// 1 以上 100 以下の整数 N が与えられます。
/// 円周率を小数第 N 位まで出力してください。
/// より厳密には、円周率を小数第 N+1 位で切り捨て、末尾の 0 を取り除かずに出力してください。
/// 制約
/// * 1≤N≤100
/// * N は整数

use proconio::*;

#[allow(non_snake_case)]
fn main() {
	input! {
		N: usize,
	}
	let s = "1415926535897932384626433832795028841971693993751058209749445923078164062862089986280348253421170679".to_string();
	let v = s.chars();
	let c = v[0];

	println!("3.{}", &s[..N]);
}
